using System;

namespace Task5
{
    class Program
    {
/*Використовуючи Visual Studio, створіть проект за шаблоном Console Application.
Потрібно:
Створити класи Point і Figure.
Клас Point повинен містити два цілочисельних поля і одне строкове поле.
Створити три властивості з одним методом доступу get, який перевіряє чи 
існує значення у відповідних полях, і виводить на консоль повідомлення, якщо результату немає.
Створити користувацький конструктор, в тілі якого проініціалізуйте поля значеннями аргументів.
Клас Figure повинен містити конструктори, які приймають від 3-х до 5-ти аргументів типу Point.
Створити два методи: double LengthSide (Point A, Point B), який розраховує довжину сторони багатокутника;
void PerimeterCalculator(), який розраховує периметр багатокутника.
Написати програму, яка виводить на екран назву і периметр багатокутника.*/

        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
    class Point
    {

    }
    class Figure
    {

    }
}
